# ---------------------------------------------------------------------------
# Core tools
# ---------------------------------------------------------------------------

brew "git"
brew "stow"
brew "vim"
brew "curl"
brew "wget"
brew "jq"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "tree"
brew "htop"
brew "bat"
brew "eza"
brew "delta"

# ---------------------------------------------------------------------------
# Dev tools
# ---------------------------------------------------------------------------

brew "gh"
brew "shellcheck"

# ---------------------------------------------------------------------------
# macOS apps (cask)
# ---------------------------------------------------------------------------

cask "ghostty"
cask "visual-studio-code"
cask "rectangle"
cask "bitwarden"

