# ---------------------------------------------------------------------------
# Core tools
# ---------------------------------------------------------------------------

brew "git"
brew "stow"
brew "vim"
brew "curl"
brew "wget"
brew "jq"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "tree"
brew "htop"
brew "bat"
brew "eza"
brew "delta"
brew "mas"
brew "tree-sitter-cli"

# ---------------------------------------------------------------------------
# Dev tools
# ---------------------------------------------------------------------------

brew "gh"
brew "shellcheck"
brew "neovim"

# ---------------------------------------------------------------------------
# macOS apps (cask)
# ---------------------------------------------------------------------------

cask "ghostty"
cask "visual-studio-code"
cask "claude"
cask "protonvpn"
cask "proton-mail"
cask "spotify"
cask "logi-options+"
cask "aldente"
cask "telegram"
cask "discord"
cask "chatgpt"
cask "rectangle"
cask "codex"
cask "helium-browser"
cask "anki"
cask "claude-code"

mas "Bitwarden", id: 1352778147
mas "uBlock Origin Lite", id: 6745342698
mas "SimpleLogin for Safari", id: 6475835429
