brew "bat"
brew "chezmoi"
brew "curl"
brew "delta"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "gh"
brew "htop"
brew "jq"
brew "ncurses"
brew "neovim"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "tree-sitter-cli"
brew "uv"
brew "vim"
brew "wget"
brew "glow"

if OS.mac?
  brew "mas"

  cask "anki"
  cask "chatgpt"
  cask "claude"
  cask "claude-code@latest"
  cask "codex"
  cask "codex-app"
  cask "discord"
  cask "helium-browser"
  cask "karabiner-elements"
  cask "logi-options+"
  cask "notion"
  cask "obsidian"
  cask "proton-mail"
  cask "protonvpn"
  cask "rectangle"
  cask "spotify"
  cask "tailscale-app"
  cask "telegram"
  cask "visual-studio-code"

  mas "Bitwarden", id: 1352778147
  mas "SimpleLogin for Safari", id: 6475835429
  mas "uBlock Origin Lite", id: 6745342698
  mas "WeChat", id: 836500024
end
